---
kind: type
id: T:Autodesk.Revit.DB.TilePattern
source: html/ed67a003-617e-1532-cd94-4faaa2bffc91.htm
---
# Autodesk.Revit.DB.TilePattern

An object representing a tile pattern that may
be applied to a DividedSurface.

## Syntax (C#)
```csharp
public class TilePattern : ElementType
```

## Remarks
TilePatterns cannot be created.
A fixed selection is built into each Conceptual Mass
family. TilePatterns can be retrieved by key from the
Revit::DB::Document::Settings::TilePatternTable object.